- **Terraform formatting and style 🖌 ``**
- **Terraform initialization ⚙️ `success`**
- **Terraform plan 📖 `success`**
- **Terraform validation 🤖 `success`**
<details><summary>Show plan output</summary>
```

module.processing_queue["prod"].data.archive_file.processing_lambda_source: Reading...
module.processing_queue["prod"].data.aws_iam_policy_document.lambda-trust-policy: Reading...
module.photo_bucket["prod"].aws_cloudfront_origin_access_identity.photo_oai: Refreshing state... [id=E2L20GH2AV9ZRW]
module.processing_queue["prod"].aws_sqs_queue.photo-processing-queue-dlq: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/172483268424/media-photo-processing-prod-dlq]
module.frontend_bucket["prod"].aws_cloudfront_origin_access_identity.frontend_oai: Refreshing state... [id=EKGC0XQKA7JD2]
module.photo_bucket["prod"].aws_s3_bucket.photo_s3_bucket: Refreshing state... [id=bata-media-photo-prod]
module.frontend_bucket["prod"].aws_s3_bucket.frontend_s3_bucket: Refreshing state... [id=bata-media-frontend-prod]
module.processing_queue["prod"].data.aws_iam_policy_document.lambda-trust-policy: Read complete after 0s [id=2690255455]
module.processing_queue["prod"].aws_iam_role.lambda-execution-role: Refreshing state... [id=media-photo-processing-prod-execution-role]
aws_s3_bucket.mysql_backup_bucket: Refreshing state... [id=bata-media-db-backup]
module.processing_queue["prod"].data.archive_file.processing_lambda_source: Read complete after 1s [id=b20a45ad35eb442bcae1a88055b57ae86eb646ee]
module.processing_queue["prod"].aws_lambda_function.processing_lambda: Refreshing state... [id=photo-processing-lambda-prod]
module.processing_queue["prod"].aws_sqs_queue.photo-processing-queue: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/172483268424/media-photo-processing-prod]
module.processing_queue["prod"].data.aws_iam_policy_document.lambda-role-policy-document: Reading...
module.processing_queue["prod"].data.aws_iam_policy_document.lambda-role-policy-document: Read complete after 0s [id=2010748321]
module.processing_queue["prod"].aws_iam_policy.lambda-role-policy: Refreshing state... [id=arn:aws:iam::172483268424:policy/media-photo-processing-prod-processing-policy]
module.processing_queue["prod"].aws_iam_role_policy_attachment.lambda-execution-role-policy: Refreshing state... [id=media-photo-processing-prod-execution-role-20250328201712565400000008]
module.processing_queue["prod"].aws_lambda_event_source_mapping.processing_lambda_event_mapping: Refreshing state... [id=016be879-7beb-4bdb-af72-9f3abcf6f087]
aws_s3_bucket_ownership_controls.s3_bucket_acl_ownership: Refreshing state... [id=bata-media-db-backup]
aws_s3_bucket_public_access_block.mysql_s3_bucket_public_acl: Refreshing state... [id=bata-media-db-backup]
aws_iam_user.mysql_backup_upload_user: Refreshing state... [id=bata-media-db-backup-db-backup-user]
aws_iam_policy.mysql_backup_upload_user_policy: Refreshing state... [id=arn:aws:iam::172483268424:policy/bata-media-db-backup-db-backup-policy]
aws_s3_bucket_lifecycle_configuration.mysql_s3_bucket_lifecycle: Refreshing state... [id=bata-media-db-backup]
module.photo_bucket["prod"].aws_s3_bucket_public_access_block.photo_s3_bucket_public_acl: Refreshing state... [id=bata-media-photo-prod]
module.photo_bucket["prod"].aws_iam_user.upload_user: Refreshing state... [id=bata-media-photo-prod-upload-user]
module.photo_bucket["prod"].aws_s3_bucket_website_configuration.photo_s3_bucket_website_configuration: Refreshing state... [id=bata-media-photo-prod]
module.photo_bucket["prod"].aws_s3_bucket_lifecycle_configuration.photo_s3_bucket_lifecycle: Refreshing state... [id=bata-media-photo-prod]
module.photo_bucket["prod"].aws_iam_policy.upload_user_policy: Refreshing state... [id=arn:aws:iam::172483268424:policy/bata-media-photo-prod-upload-policy]
module.photo_bucket["prod"].data.aws_iam_policy_document.photo_allow_cloudfront: Reading...
module.photo_bucket["prod"].data.aws_iam_policy_document.photo_allow_cloudfront: Read complete after 0s [id=1452836004]
module.photo_bucket["prod"].aws_s3_bucket_policy.photo_s3_bucket_policy: Refreshing state... [id=bata-media-photo-prod]
module.frontend_bucket["prod"].aws_iam_user.upload_user: Refreshing state... [id=bata-media-frontend-prod-upload-user]
module.frontend_bucket["prod"].data.aws_iam_policy_document.frontend_allow_cloudfront: Reading...
module.frontend_bucket["prod"].data.aws_iam_policy_document.frontend_allow_cloudfront: Read complete after 0s [id=1577279431]
module.frontend_bucket["prod"].aws_s3_bucket_website_configuration.frontend_s3_bucket_website_configuration: Refreshing state... [id=bata-media-frontend-prod]
module.frontend_bucket["prod"].aws_s3_bucket_ownership_controls.s3_bucket_acl_ownership: Refreshing state... [id=bata-media-frontend-prod]
module.frontend_bucket["prod"].aws_cloudfront_distribution.frontend_cloudfront_distribution: Refreshing state... [id=E38Z5KAIBO7480]
module.frontend_bucket["prod"].aws_s3_bucket_public_access_block.frontend_s3_bucket_public_acl: Refreshing state... [id=bata-media-frontend-prod]
module.frontend_bucket["prod"].aws_s3_bucket_policy.frontend_s3_bucket_policy: Refreshing state... [id=bata-media-frontend-prod]
aws_iam_user_policy_attachment.mysql_backup_user_attachment: Refreshing state... [id=bata-media-db-backup-db-backup-user-20250328201628443000000007]
module.photo_bucket["prod"].aws_iam_user_policy_attachment.upload_user_attachment: Refreshing state... [id=bata-media-photo-prod-upload-user-2025032820173573590000000b]
aws_s3_bucket_acl.mysql_s3_bucket_acl: Refreshing state... [id=bata-media-db-backup,private]
module.frontend_bucket["prod"].aws_iam_policy.upload_user_policy: Refreshing state... [id=arn:aws:iam::172483268424:policy/bata-media-frontend-prod-upload-policy]
module.frontend_bucket["prod"].aws_s3_bucket_acl.frontend_s3_bucket_acl: Refreshing state... [id=bata-media-frontend-prod,private]
module.frontend_bucket["prod"].aws_iam_user_policy_attachment.upload_user_attachment: Refreshing state... [id=bata-media-frontend-prod-upload-user-2025032820223431810000000d]
module.photo_bucket["prod"].aws_s3_bucket_cors_configuration.photo_s3_bucket_cors: Refreshing state... [id=bata-media-photo-prod]
module.photo_bucket["prod"].aws_cloudfront_response_headers_policy.photo_cloudfront_response_headers_policy: Refreshing state... [id=a2b677b2-9e82-45ba-a596-f02bbd373d52]
module.photo_bucket["prod"].aws_cloudfront_distribution.photo_cloudfront_distribution: Refreshing state... [id=E33EP76ZM4MG42]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.processing_queue["prod"].aws_lambda_function.processing_lambda will be updated in-place
  ~ resource "aws_lambda_function" "processing_lambda" {
        id                             = "photo-processing-lambda-prod"
      ~ last_modified                  = "2025-03-30T13:53:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "reTEAy5lj1iIpdYInO8dkUXw7FTrVJdZ4lK2u5OTVJ8=" -> "h7YUwd/E3beqYkgecHeVs61UEfHxf0gYIvbrXYXpPeI="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.route53["prod"].aws_route53_record.frontend_bucket_record_a will be created
  + resource "aws_route53_record" "frontend_bucket_record_a" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www"
      + type            = "A"
      + zone_id         = "Z04677781OQ1QDD432K8J"

      + alias {
          + evaluate_target_health = false
          + name                   = "d2xvfovm2g87sq.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # module.route53["prod"].aws_route53_record.frontend_bucket_record_aaaa will be created
  + resource "aws_route53_record" "frontend_bucket_record_aaaa" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www"
      + type            = "AAAA"
      + zone_id         = "Z04677781OQ1QDD432K8J"

      + alias {
          + evaluate_target_health = false
          + name                   = "d2xvfovm2g87sq.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # module.route53["prod"].aws_route53_record.photo_bucket_record_a will be created
  + resource "aws_route53_record" "photo_bucket_record_a" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "assets"
      + type            = "A"
      + zone_id         = "Z04677781OQ1QDD432K8J"

      + alias {
          + evaluate_target_health = false
          + name                   = "d45b0zvkwy6z1.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # module.route53["prod"].aws_route53_record.photo_bucket_record_aaaa will be created
  + resource "aws_route53_record" "photo_bucket_record_aaaa" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "assets"
      + type            = "AAAA"
      + zone_id         = "Z04677781OQ1QDD432K8J"

      + alias {
          + evaluate_target_health = false
          + name                   = "d45b0zvkwy6z1.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

Plan: 4 to add, 1 to change, 0 to destroy.

Warning: Invalid Attribute Combination

  with aws_s3_bucket_lifecycle_configuration.mysql_s3_bucket_lifecycle,
  on mysql-backup.tf line 26, in resource "aws_s3_bucket_lifecycle_configuration" "mysql_s3_bucket_lifecycle":
  26:   rule {

No attribute specified when one (and only one) of [rule[0].prefix.<.filter]
is required

This will be an error in a future version of the provider

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @jonathanjuursema*